Revit 2027 API
AnalyticalOpening.PanelId Property
 ElementId of the AnalyticalPanel parent.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId PanelId { get; }
Public ReadOnly Property PanelId As ElementId
	Get
public:
property ElementId^ PanelId {
	ElementId^ get ();
}
member PanelId : ElementId with get
Property Value
ElementId
See Also
Reference
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace